{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Conv2D","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D31","trainable":true,"batch_input_shape":[null,28,28,1],"dtype":"float32"}},{"class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D31","trainable":true}},{"class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D32","trainable":true}},{"class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D32","trainable":true}},{"class_name":"Flatten","config":{"name":"flatten_Flatten16","trainable":true}},{"class_name":"Dense","config":{"units":10,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":null,"distribution":null,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense16","trainable":true}}],"keras_version":"tfjs-layers 0.7.4","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./handwriting-digits-classifier-v2.weights.bin"],"weights":[{"name":"conv2d_Conv2D31/kernel","shape":[5,5,1,8],"dtype":"float32"},{"name":"conv2d_Conv2D31/bias","shape":[8],"dtype":"float32"},{"name":"conv2d_Conv2D32/kernel","shape":[5,5,8,16],"dtype":"float32"},{"name":"conv2d_Conv2D32/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense16/kernel","shape":[256,10],"dtype":"float32"},{"name":"dense_Dense16/bias","shape":[10],"dtype":"float32"}]}]}